bentPipe-series/cfMesh/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

surfaceFeatureEdges -angle 5 bentPipe.stl bentPipe.fms

cartesianMesh

#------------------------------------------------------------------------------
